torbrodtkorb/alva-master/firmware/pack/edc/AVR64DB64.PIC
        <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OP1STATUS" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x719">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
              <edc:SFRFieldDef edc:cname="SETTLED" edc:nzwidth="0x1" edc:desc="Settled"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OP1RESMUX" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x71A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
              <edc:SFRFieldDef edc:cname="MUXTOP" edc:nzwidth="0x2" edc:desc="Multiplexer Top">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Multiplexer off" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="OPn output" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VDD" edc:desc="VDD" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MUXBOT" edc:nzwidth="0x3" edc:desc="Multiplexer Bottom">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Multiplexer off" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="INP" edc:desc="Positive input pin for OPn" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="INN" edc:desc="Negative input pin for OPn" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC output" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="LINKOUT" edc:desc="Link OP[n-1] output" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7) == 0x05"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="MUXWIP" edc:nzwidth="0x3" edc:desc="Multiplexer Wiper selector">
                <edc:SFRFieldSemantic edc:cname="WIP0" edc:desc="R1 = 15R, R2 = 1R, R2/R1 = 0.07" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="WIP1" edc:desc="R1 = 14R, R2 = 2R, R2/R1 = 0.14" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="WIP2" edc:desc="R1 = 12R, R2 = 4R, R2/R1 = 0.33" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="WIP3" edc:desc="R1 = 8R, R2 = 8R, R2/R1 = 1" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="WIP4" edc:desc="R1 = 6R, R2 = 10R, R2/R1 = 1.67" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="WIP5" edc:desc="R1 = 4R, R2 = 12R, R2/R1 = 3" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="WIP6" edc:desc="R1 = 2R, R2 = 14R, R2/R1 = 7" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="WIP7" edc:desc="R1 = 1R, R2 = 15R, R2/R1 = 15" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OP1INMUX" edc:nzwidth="0x8" edc:access="-nnn-nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x77" edc:_addr="0x71B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
              <edc:SFRFieldDef edc:cname="MUXPOS" edc:nzwidth="0x3" edc:desc="Positive Input Multiplexer">
                <edc:SFRFieldSemantic edc:cname="INP" edc:desc="Positive input pin for OPn" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="WIP" edc:desc="Wiper from OPn's resistor ladder" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC output" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Ground" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VDDDIV2" edc:desc="VDD/2" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="LINKOUT" edc:desc="Output from OP0" edc:when="(field &amp; 0x7) == 0x05"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="MUXNEG" edc:nzwidth="0x3" edc:desc="Negative Input Multiplexer">
                <edc:SFRFieldSemantic edc:cname="INN" edc:desc="Negative input pin for OPn" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="WIP" edc:desc="Wiper from OPn's resistor ladder" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="OPn output (unity gain)" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC output" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OP1SETTLE" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0x71C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
              <edc:SFRFieldDef edc:cname="SETTLE" edc:nzwidth="0x7" edc:desc="Settle Time"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OP1CAL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x71D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
              <edc:SFRFieldDef edc:cname="CAL" edc:nzwidth="0x8" edc:desc="Calibration (for input offset voltage)"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x71E"/>
        <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OP2CTRLA" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:_addr="0x720">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
              <edc:SFRFieldDef edc:cname="ALWAYSON" edc:nzwidth="0x1" edc:desc="Always On"/>
              <edc:SFRFieldDef edc:cname="EVENTEN" edc:nzwidth="0x1" edc:desc="Enable Events"/>
              <edc:SFRFieldDef edc:cname="OUTMODE" edc:nzwidth="0x2" edc:desc="Output Mode">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Output Driver Off" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Output Driver in Normal Mode" edc:when="(field &amp; 0x3) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RUNSTBY" edc:nzwidth="0x1" edc:desc="Run in Standby Mode"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="OPAMP" edc:cname="OP2STATUS" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x721">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OPAMP">
              <edc:SFRFieldDef edc:cname="SETTLED" edc:nzwidth="0x1" edc:desc="Settled"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
