torbrodtkorb/alva-master/firmware/pack/edc/AVR64DB64.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="CLKOUT" edc:ppsfunction="CLKCTRL" ltx:memberofperipheral="CLKCTRL"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS_ALT1" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD0" ltx:memberofperipheral="ZCD0"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD1" ltx:memberofperipheral="ZCD1"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD2" ltx:memberofperipheral="ZCD2"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI0" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="WOD3D0" edc:ppsfunction="TCD0" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0_ALT1" ltx:memberofperipheral="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="LUT4_IN0" edc:ppsfunction="CCL_IN" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART3" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT1" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO0A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="LUT4_IN1" edc:ppsfunction="CCL_IN" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART3" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT1" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO1A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2"/>
      <edc:VirtualPin edc:name="EVOUT1" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT4_IN2" edc:ppsfunction="CCL_IN" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C1_ALT2" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="SDA_DUAL" edc:ppsfunction="I2C1" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT1" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO2A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART3" ltx:memberofperipheral="USART3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3"/>
      <edc:VirtualPin edc:name="LUT4_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C1_ALT2" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="SCL_DUAL" edc:ppsfunction="I2C1" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT1" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO3A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART3" ltx:memberofperipheral="USART3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI1_ALT1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART3_ALT1" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="WO0B2" edc:ppsfunction="TCB2_ALT1" ltx:memberofperipheral="TCB2"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0_ALT1" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO4A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WOAD0" edc:ppsfunction="TCD0_ALT1" ltx:memberofperipheral="TCD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI1_ALT1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART3_ALT1" ltx:memberofperipheral="USART3"/>
      <edc:VirtualPin edc:name="WO0B3" edc:ppsfunction="TCB3" ltx:memberofperipheral="TCB3"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0_ALT1" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO5A1" edc:ppsfunction="TCA1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WOB1D0" edc:ppsfunction="TCD0_ALT1" ltx:memberofperipheral="TCD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB6"/>
      <edc:VirtualPin edc:name="LUT4_OUT0" edc:ppsfunction="CCL_ALT1" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI1_ALT1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="SDA_DUAL" edc:ppsfunction="I2C1_ALT1" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="SDA_DUAL" edc:ppsfunction="I2C1_ALT2" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="WOC2D0" edc:ppsfunction="TCD0_ALT1" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART3_ALT1" ltx:memberofperipheral="USART3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7"/>
      <edc:VirtualPin edc:name="EVOUT1" edc:ppsfunction="EVSYS_ALT1" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTB"/>
      <edc:VirtualPin edc:name="SCL_DUAL" edc:ppsfunction="I2C1_ALT1" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="SCL_DUAL" edc:ppsfunction="I2C1_ALT2" ltx:memberofperipheral="TWI1"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI1_ALT1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="WOD3D0" edc:ppsfunction="TCD0_ALT1" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART3_ALT1" ltx:memberofperipheral="USART3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0"/>
      <edc:VirtualPin edc:name="LUT1_IN0" edc:ppsfunction="CCL_IN" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO0B2" edc:ppsfunction="TCB2" ltx:memberofperipheral="TCB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1"/>
      <edc:VirtualPin edc:name="LUT1_IN1" edc:ppsfunction="CCL_IN" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO0B3" edc:ppsfunction="TCB3_ALT1" ltx:memberofperipheral="TCB3"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2"/>
      <edc:VirtualPin edc:name="EVOUT2" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT1_IN2" edc:ppsfunction="CCL_IN" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C0_ALT2" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="SDA_DUAL" edc:ppsfunction="I2C0" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3"/>
      <edc:VirtualPin edc:name="LUT1_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C0_ALT2" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="SCL_DUAL" edc:ppsfunction="I2C0" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI1_ALT2" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART1_ALT1" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO0A1" edc:ppsfunction="TCA1_ALT1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI1_ALT2" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART1_ALT1" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO1A1" edc:ppsfunction="TCA1_ALT1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6"/>
      <edc:VirtualPin edc:name="LUT1_OUT0" edc:ppsfunction="CCL_ALT1" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC0_ALT1" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC1_ALT1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC2_ALT1" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI1_ALT2" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="SDA_DUAL" edc:ppsfunction="I2C0_ALT1" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="SDA_DUAL" edc:ppsfunction="I2C0_ALT2" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="WO0B4" edc:ppsfunction="TCB4_ALT1" ltx:memberofperipheral="TCB4"/>
      <edc:VirtualPin edc:name="WO2A1" edc:ppsfunction="TCA1_ALT1" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART1_ALT1" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7"/>
      <edc:VirtualPin edc:name="EVOUT2" edc:ppsfunction="EVSYS_ALT1" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD0_ALT1" ltx:memberofperipheral="ZCD0"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD1_ALT1" ltx:memberofperipheral="ZCD1"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD2_ALT1" ltx:memberofperipheral="ZCD2"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCL_DUAL" edc:ppsfunction="I2C0_ALT" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="SCL_DUAL" edc:ppsfunction="I2C0_ALT2" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI1_ALT2" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART1_ALT1" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT2_IN0" edc:ppsfunction="CCL_IN" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="IN" edc:ppsfunction="ZCD0" ltx:memberofperipheral="ZCD0"/>
      <edc:VirtualPin edc:name="LUT2_IN1" edc:ppsfunction="CCL_IN" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OP0INP" edc:ppsfunction="OPAMP" ltx:memberofperipheral="OPAMP"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT2_IN2" edc:ppsfunction="CCL_IN" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OP0OUT" edc:ppsfunction="OPAMP" ltx:memberofperipheral="OPAMP"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT2_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="OP0INN" edc:ppsfunction="OPAMP" ltx:memberofperipheral="OPAMP"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="OP1INP" edc:ppsfunction="OPAMP" ltx:memberofperipheral="OPAMP"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="AIN5" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="OP1OUT" edc:ppsfunction="OPAMP" ltx:memberofperipheral="OPAMP"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT2_OUT0" edc:ppsfunction="CCL_ALT1" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="DAC0" ltx:memberofperipheral="DAC0"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS_ALT1" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="OP1INN" edc:ppsfunction="OPAMP" ltx:memberofperipheral="OPAMP"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AGND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE0"/>
      <edc:VirtualPin edc:name="AIN8" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI0_ALT1" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTE"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART4" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT4" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE1"/>
      <edc:VirtualPin edc:name="AIN9" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI0_ALT1" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="OP2INP" edc:ppsfunction="OPAMP" ltx:memberofperipheral="OPAMP"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTE"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART4" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT4" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2"/>
      <edc:VirtualPin edc:name="AIN10" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="EVOUT4" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="OP2OUT" edc:ppsfunction="OPAMP" ltx:memberofperipheral="OPAMP"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTE"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI0_ALT1" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT4" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART4" ltx:memberofperipheral="USART4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE3"/>
      <edc:VirtualPin edc:name="AIN11" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="IN" edc:ppsfunction="ZCD1" ltx:memberofperipheral="ZCD1"/>
      <edc:VirtualPin edc:name="OP2INN" edc:ppsfunction="OPAMP" ltx:memberofperipheral="OPAMP"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTE"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI0_ALT1" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT4" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART4" ltx:memberofperipheral="USART4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE4"/>
      <edc:VirtualPin edc:name="AIN12" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTE"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART4_ALT1" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="WO0A1" edc:ppsfunction="TCA1_ALT2" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0_ALT4" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE5"/>
      <edc:VirtualPin edc:name="AIN13" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTE"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART4_ALT1" ltx:memberofperipheral="USART4"/>
      <edc:VirtualPin edc:name="WO1A1" edc:ppsfunction="TCA1_ALT2" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0_ALT4" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE6"/>
      <edc:VirtualPin edc:name="AIN14" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTE"/>
      <edc:VirtualPin edc:name="WO2A1" edc:ppsfunction="TCA1_ALT2" ltx:memberofperipheral="TCA1"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART4_ALT1" ltx:memberofperipheral="USART4"/>
    </edc:Pin>
